content/posts/20200623233650-evergreen_notes.md
+++
title = "Evergreen notes"
author = ["Alex Day"]
lastmod = 2020-12-13T20:16:38-05:00
draft = false
+++

Evergreen notes are notes about one concept that are heavily linked to. I think these are central notes in your note graph that everything revolves around. There are a couple of "Rules" for evergreen notes that I have seen around:

1.  Be atomic (about one specific thing)

    This keeps the single notes from becoming too big and swallowing other notes. This means that every edge on the graph is meaningful and specific

2.  Be concept oriented

    Think about taking notes in a class. You may segment notes by day, maybe by chapter. This rule argues that you should segment by concept. This allows you to discover connections across books and domains.

3.  Densely linked

    This is what is being built to. By keeping your notes small and about one thing they are easy to link to in the right context. This allows you to build a second brain with its own pathways and nodes.


## Other writings on Evergreen Notes {#other-writings-on-evergreen-notes}

-   [Andy Matuschak](https://notes.andymatuschak.org/Evergreen%5Fnotes)
